package ru.permkrai.it.android.objectsonmap.repositories

import androidx.annotation.WorkerThread
import ru.permkrai.it.android.objectsonmap.dao.IDAOObjects
import ru.permkrai.it.android.objectsonmap.model.CObject
import java.util.UUID

/********************************************************************************************************
 * Репозиторий для работы с данными об объектах.                                                        *
 * @author Селетков И.П. 2022 1116.                                                                     *
 *******************************************************************************************************/
class CRepositoryObjects(
    private val daoObjects                  : IDAOObjects
    )
{
    /****************************************************************************************************
     * Получение списка всех элементов.                                                                 *
     ***************************************************************************************************/
    fun getAll()                            = daoObjects.getAll()

    /****************************************************************************************************
     * Получение элемента по идентификатору.                                                            *
     * @param id - идентификатор элемента для поиска.                                                   *
     * @return объект с идентификатором id или ??? (упадёт) в случае отсутствия.                        *
     ***************************************************************************************************/
    fun getById(
        id                                  : UUID
    )                                       = daoObjects.getById(id)

    /****************************************************************************************************
     * Сохранение нового элемента в БД.                                                                 *
     * @param item - объект для сохранения.                                                             *
     ***************************************************************************************************/
    @Suppress("RedundantSuspendModifier")
    @WorkerThread
    suspend fun insert(
        item                                : CObject
    ) {
        daoObjects.insertAll(item)
    }
    /****************************************************************************************************
     * Удаление существующего объекта.                                                                  *
     * @param item - объект для удаления.                                                               *
     ***************************************************************************************************/
    @WorkerThread
    suspend fun delete(
        item                            : CObject
    ) {
        daoObjects.delete(item)
    }
    /****************************************************************************************************
     * Обновление существующего объекта.                                                                *
     * @param item - объект для обновления.                                                             *
     ***************************************************************************************************/
    suspend fun update(
        item                            : CObject
    ) {
        daoObjects.update(item)
    }

}