package ru.permkrai.it.android.objectsonmap.dao

import androidx.room.*
import kotlinx.coroutines.flow.Flow
import ru.permkrai.it.android.objectsonmap.model.CObject
import java.util.*

/********************************************************************************************************
 * Интерфейс содержит запросы в СУБД на получение/запись данных.                                        *
 * @author Селетков И.П. 2022 1116.                                                                     *
 *******************************************************************************************************/
@Dao
interface IDAOObjects {
    /****************************************************************************************************
     * Получение списка всех элементов.                                                                 *
     ***************************************************************************************************/
    @Query("SELECT * FROM objects")
    fun getAllFlow()                        : Flow<List<CObject>>

    /****************************************************************************************************
     * Запрос элемента по идентификатору.                                                               *
     * @param id - идентификатор элемента для поиска.                                                   *
     * @return объект с идентификатором id или пустой поток в случае отсутствия.                        *
     ***************************************************************************************************/
    @Query("SELECT * FROM objects WHERE id=:id")
    fun getByIdFlow(
        id                                  : UUID
    )                                       : Flow<CObject>

    @Query("SELECT * FROM objects WHERE id=:id")
    fun getById(
        id                                  : UUID
    )                                       : CObject?
    /****************************************************************************************************
     * Сохранение нескольких новых элементов в БД.                                                      *
     * @param items - объект или объекты для сохранения.                                              *
     ***************************************************************************************************/
    @Insert
    suspend fun insertAll(
        vararg items                      : CObject
    )

    /****************************************************************************************************
     * Обновление существующего объекта.                                                                *
     * @param item - объект для обновления.                                                           *
     ***************************************************************************************************/
    @Update
    suspend fun update(
        item                                : CObject
    )

    /****************************************************************************************************
     * Удаление существующего объекта.                                                                  *
     * @param item - объект для удаления.                                                             *
     ***************************************************************************************************/
    @Delete
    suspend fun delete(
        item                                : CObject)
}